__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 3, 96, 96)    0                                            
__________________________________________________________________________________________________
zero_padding2d_1 (ZeroPadding2D (None, 3, 102, 102)  0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 64, 48, 48)   9472        zero_padding2d_1[0][0]           
__________________________________________________________________________________________________
bn1 (BatchNormalization)        (None, 64, 48, 48)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 64, 48, 48)   0           bn1[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_2 (ZeroPadding2D (None, 64, 50, 50)   0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 24, 24)   0           zero_padding2d_2[0][0]           
__________________________________________________________________________________________________
conv2 (Conv2D)                  (None, 64, 24, 24)   4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2 (BatchNormalization)        (None, 64, 24, 24)   256         conv2[0][0]                      
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 64, 24, 24)   0           bn2[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_3 (ZeroPadding2D (None, 64, 26, 26)   0           activation_2[0][0]               
__________________________________________________________________________________________________
conv3 (Conv2D)                  (None, 192, 24, 24)  110784      zero_padding2d_3[0][0]           
__________________________________________________________________________________________________
bn3 (BatchNormalization)        (None, 192, 24, 24)  768         conv3[0][0]                      
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 192, 24, 24)  0           bn3[0][0]                        
__________________________________________________________________________________________________
zero_padding2d_4 (ZeroPadding2D (None, 192, 26, 26)  0           activation_3[0][0]               
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 192, 12, 12)  0           zero_padding2d_4[0][0]           
__________________________________________________________________________________________________
inception_3a_3x3_conv1 (Conv2D) (None, 96, 12, 12)   18528       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
inception_3a_5x5_conv1 (Conv2D) (None, 16, 12, 12)   3088        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
inception_3a_3x3_bn1 (BatchNorm (None, 96, 12, 12)   384         inception_3a_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_3a_5x5_bn1 (BatchNorm (None, 16, 12, 12)   64          inception_3a_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 96, 12, 12)   0           inception_3a_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 16, 12, 12)   0           inception_3a_5x5_bn1[0][0]       
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 192, 5, 5)    0           max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
zero_padding2d_5 (ZeroPadding2D (None, 96, 14, 14)   0           activation_4[0][0]               
__________________________________________________________________________________________________
zero_padding2d_6 (ZeroPadding2D (None, 16, 16, 16)   0           activation_6[0][0]               
__________________________________________________________________________________________________
inception_3a_pool_conv (Conv2D) (None, 32, 5, 5)     6176        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
inception_3a_3x3_conv2 (Conv2D) (None, 128, 12, 12)  110720      zero_padding2d_5[0][0]           
__________________________________________________________________________________________________
inception_3a_5x5_conv2 (Conv2D) (None, 32, 12, 12)   12832       zero_padding2d_6[0][0]           
__________________________________________________________________________________________________
inception_3a_pool_bn (BatchNorm (None, 32, 5, 5)     128         inception_3a_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_3a_1x1_conv (Conv2D)  (None, 64, 12, 12)   12352       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
inception_3a_3x3_bn2 (BatchNorm (None, 128, 12, 12)  512         inception_3a_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_3a_5x5_bn2 (BatchNorm (None, 32, 12, 12)   128         inception_3a_5x5_conv2[0][0]     
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 32, 5, 5)     0           inception_3a_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_3a_1x1_bn (BatchNorma (None, 64, 12, 12)   256         inception_3a_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 128, 12, 12)  0           inception_3a_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 32, 12, 12)   0           inception_3a_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_7 (ZeroPadding2D (None, 32, 12, 12)   0           activation_8[0][0]               
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 64, 12, 12)   0           inception_3a_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 256, 12, 12)  0           activation_5[0][0]               
                                                                 activation_7[0][0]               
                                                                 zero_padding2d_7[0][0]           
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
inception_3b_3x3_conv1 (Conv2D) (None, 96, 12, 12)   24672       concatenate_1[0][0]              
__________________________________________________________________________________________________
inception_3b_5x5_conv1 (Conv2D) (None, 32, 12, 12)   8224        concatenate_1[0][0]              
__________________________________________________________________________________________________
inception_3b_3x3_bn1 (BatchNorm (None, 96, 12, 12)   384         inception_3b_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_3b_5x5_bn1 (BatchNorm (None, 32, 12, 12)   128         inception_3b_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 96, 12, 12)   0           inception_3b_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 32, 12, 12)   0           inception_3b_5x5_bn1[0][0]       
__________________________________________________________________________________________________
average_pooling2d_1 (AveragePoo (None, 256, 4, 4)    0           concatenate_1[0][0]              
__________________________________________________________________________________________________
zero_padding2d_8 (ZeroPadding2D (None, 96, 14, 14)   0           activation_10[0][0]              
__________________________________________________________________________________________________
zero_padding2d_9 (ZeroPadding2D (None, 32, 16, 16)   0           activation_12[0][0]              
__________________________________________________________________________________________________
inception_3b_pool_conv (Conv2D) (None, 64, 4, 4)     16448       average_pooling2d_1[0][0]        
__________________________________________________________________________________________________
inception_3b_3x3_conv2 (Conv2D) (None, 128, 12, 12)  110720      zero_padding2d_8[0][0]           
__________________________________________________________________________________________________
inception_3b_5x5_conv2 (Conv2D) (None, 64, 12, 12)   51264       zero_padding2d_9[0][0]           
__________________________________________________________________________________________________
inception_3b_pool_bn (BatchNorm (None, 64, 4, 4)     256         inception_3b_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_3b_1x1_conv (Conv2D)  (None, 64, 12, 12)   16448       concatenate_1[0][0]              
__________________________________________________________________________________________________
inception_3b_3x3_bn2 (BatchNorm (None, 128, 12, 12)  512         inception_3b_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_3b_5x5_bn2 (BatchNorm (None, 64, 12, 12)   256         inception_3b_5x5_conv2[0][0]     
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 64, 4, 4)     0           inception_3b_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_3b_1x1_bn (BatchNorma (None, 64, 12, 12)   256         inception_3b_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 128, 12, 12)  0           inception_3b_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 64, 12, 12)   0           inception_3b_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_10 (ZeroPadding2 (None, 64, 12, 12)   0           activation_14[0][0]              
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 64, 12, 12)   0           inception_3b_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 320, 12, 12)  0           activation_11[0][0]              
                                                                 activation_13[0][0]              
                                                                 zero_padding2d_10[0][0]          
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
inception_3c_3x3_conv1 (Conv2D) (None, 128, 12, 12)  41088       concatenate_2[0][0]              
__________________________________________________________________________________________________
inception_3c_5x5_conv1 (Conv2D) (None, 32, 12, 12)   10272       concatenate_2[0][0]              
__________________________________________________________________________________________________
inception_3c_3x3_bn1 (BatchNorm (None, 128, 12, 12)  512         inception_3c_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_3c_5x5_bn1 (BatchNorm (None, 32, 12, 12)   128         inception_3c_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 128, 12, 12)  0           inception_3c_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 32, 12, 12)   0           inception_3c_5x5_bn1[0][0]       
__________________________________________________________________________________________________
zero_padding2d_11 (ZeroPadding2 (None, 128, 14, 14)  0           activation_16[0][0]              
__________________________________________________________________________________________________
zero_padding2d_12 (ZeroPadding2 (None, 32, 16, 16)   0           activation_18[0][0]              
__________________________________________________________________________________________________
inception_3c_3x3_conv2 (Conv2D) (None, 256, 6, 6)    295168      zero_padding2d_11[0][0]          
__________________________________________________________________________________________________
inception_3c_5x5_conv2 (Conv2D) (None, 64, 6, 6)     51264       zero_padding2d_12[0][0]          
__________________________________________________________________________________________________
inception_3c_3x3_bn2 (BatchNorm (None, 256, 6, 6)    1024        inception_3c_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_3c_5x5_bn2 (BatchNorm (None, 64, 6, 6)     256         inception_3c_5x5_conv2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 320, 5, 5)    0           concatenate_2[0][0]              
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 256, 6, 6)    0           inception_3c_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 64, 6, 6)     0           inception_3c_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_13 (ZeroPadding2 (None, 320, 6, 6)    0           max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 640, 6, 6)    0           activation_17[0][0]              
                                                                 activation_19[0][0]              
                                                                 zero_padding2d_13[0][0]          
__________________________________________________________________________________________________
inception_4a_3x3_conv1 (Conv2D) (None, 96, 6, 6)     61536       concatenate_3[0][0]              
__________________________________________________________________________________________________
inception_4a_5x5_conv1 (Conv2D) (None, 32, 6, 6)     20512       concatenate_3[0][0]              
__________________________________________________________________________________________________
inception_4a_3x3_bn1 (BatchNorm (None, 96, 6, 6)     384         inception_4a_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_4a_5x5_bn1 (BatchNorm (None, 32, 6, 6)     128         inception_4a_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 96, 6, 6)     0           inception_4a_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 32, 6, 6)     0           inception_4a_5x5_bn1[0][0]       
__________________________________________________________________________________________________
average_pooling2d_2 (AveragePoo (None, 640, 2, 2)    0           concatenate_3[0][0]              
__________________________________________________________________________________________________
zero_padding2d_14 (ZeroPadding2 (None, 96, 8, 8)     0           activation_20[0][0]              
__________________________________________________________________________________________________
zero_padding2d_15 (ZeroPadding2 (None, 32, 10, 10)   0           activation_22[0][0]              
__________________________________________________________________________________________________
inception_4a_pool_conv (Conv2D) (None, 128, 2, 2)    82048       average_pooling2d_2[0][0]        
__________________________________________________________________________________________________
inception_4a_3x3_conv2 (Conv2D) (None, 192, 6, 6)    166080      zero_padding2d_14[0][0]          
__________________________________________________________________________________________________
inception_4a_5x5_conv2 (Conv2D) (None, 64, 6, 6)     51264       zero_padding2d_15[0][0]          
__________________________________________________________________________________________________
inception_4a_pool_bn (BatchNorm (None, 128, 2, 2)    512         inception_4a_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_4a_1x1_conv (Conv2D)  (None, 256, 6, 6)    164096      concatenate_3[0][0]              
__________________________________________________________________________________________________
inception_4a_3x3_bn2 (BatchNorm (None, 192, 6, 6)    768         inception_4a_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_4a_5x5_bn2 (BatchNorm (None, 64, 6, 6)     256         inception_4a_5x5_conv2[0][0]     
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 128, 2, 2)    0           inception_4a_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_4a_1x1_bn (BatchNorma (None, 256, 6, 6)    1024        inception_4a_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 192, 6, 6)    0           inception_4a_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 64, 6, 6)     0           inception_4a_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_16 (ZeroPadding2 (None, 128, 6, 6)    0           activation_24[0][0]              
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 256, 6, 6)    0           inception_4a_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 640, 6, 6)    0           activation_21[0][0]              
                                                                 activation_23[0][0]              
                                                                 zero_padding2d_16[0][0]          
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
inception_4e_3x3_conv1 (Conv2D) (None, 160, 6, 6)    102560      concatenate_4[0][0]              
__________________________________________________________________________________________________
inception_4e_5x5_conv1 (Conv2D) (None, 64, 6, 6)     41024       concatenate_4[0][0]              
__________________________________________________________________________________________________
inception_4e_3x3_bn1 (BatchNorm (None, 160, 6, 6)    640         inception_4e_3x3_conv1[0][0]     
__________________________________________________________________________________________________
inception_4e_5x5_bn1 (BatchNorm (None, 64, 6, 6)     256         inception_4e_5x5_conv1[0][0]     
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 160, 6, 6)    0           inception_4e_3x3_bn1[0][0]       
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 64, 6, 6)     0           inception_4e_5x5_bn1[0][0]       
__________________________________________________________________________________________________
zero_padding2d_17 (ZeroPadding2 (None, 160, 8, 8)    0           activation_26[0][0]              
__________________________________________________________________________________________________
zero_padding2d_18 (ZeroPadding2 (None, 64, 10, 10)   0           activation_28[0][0]              
__________________________________________________________________________________________________
inception_4e_3x3_conv2 (Conv2D) (None, 256, 3, 3)    368896      zero_padding2d_17[0][0]          
__________________________________________________________________________________________________
inception_4e_5x5_conv2 (Conv2D) (None, 128, 3, 3)    204928      zero_padding2d_18[0][0]          
__________________________________________________________________________________________________
inception_4e_3x3_bn2 (BatchNorm (None, 256, 3, 3)    1024        inception_4e_3x3_conv2[0][0]     
__________________________________________________________________________________________________
inception_4e_5x5_bn2 (BatchNorm (None, 128, 3, 3)    512         inception_4e_5x5_conv2[0][0]     
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 640, 2, 2)    0           concatenate_4[0][0]              
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 256, 3, 3)    0           inception_4e_3x3_bn2[0][0]       
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 128, 3, 3)    0           inception_4e_5x5_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_19 (ZeroPadding2 (None, 640, 3, 3)    0           max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 1024, 3, 3)   0           activation_27[0][0]              
                                                                 activation_29[0][0]              
                                                                 zero_padding2d_19[0][0]          
__________________________________________________________________________________________________
inception_5a_3x3_conv1 (Conv2D) (None, 96, 3, 3)     98400       concatenate_5[0][0]              
__________________________________________________________________________________________________
inception_5a_3x3_bn1 (BatchNorm (None, 96, 3, 3)     384         inception_5a_3x3_conv1[0][0]     
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 96, 3, 3)     0           inception_5a_3x3_bn1[0][0]       
__________________________________________________________________________________________________
average_pooling2d_3 (AveragePoo (None, 1024, 1, 1)   0           concatenate_5[0][0]              
__________________________________________________________________________________________________
zero_padding2d_20 (ZeroPadding2 (None, 96, 5, 5)     0           activation_30[0][0]              
__________________________________________________________________________________________________
inception_5a_pool_conv (Conv2D) (None, 96, 1, 1)     98400       average_pooling2d_3[0][0]        
__________________________________________________________________________________________________
inception_5a_3x3_conv2 (Conv2D) (None, 384, 3, 3)    332160      zero_padding2d_20[0][0]          
__________________________________________________________________________________________________
inception_5a_pool_bn (BatchNorm (None, 96, 1, 1)     384         inception_5a_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_5a_1x1_conv (Conv2D)  (None, 256, 3, 3)    262400      concatenate_5[0][0]              
__________________________________________________________________________________________________
inception_5a_3x3_bn2 (BatchNorm (None, 384, 3, 3)    1536        inception_5a_3x3_conv2[0][0]     
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 96, 1, 1)     0           inception_5a_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_5a_1x1_bn (BatchNorma (None, 256, 3, 3)    1024        inception_5a_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 384, 3, 3)    0           inception_5a_3x3_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_21 (ZeroPadding2 (None, 96, 3, 3)     0           activation_32[0][0]              
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 256, 3, 3)    0           inception_5a_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 736, 3, 3)    0           activation_31[0][0]              
                                                                 zero_padding2d_21[0][0]          
                                                                 activation_33[0][0]              
__________________________________________________________________________________________________
inception_5b_3x3_conv1 (Conv2D) (None, 96, 3, 3)     70752       concatenate_6[0][0]              
__________________________________________________________________________________________________
inception_5b_3x3_bn1 (BatchNorm (None, 96, 3, 3)     384         inception_5b_3x3_conv1[0][0]     
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 96, 3, 3)     0           inception_5b_3x3_bn1[0][0]       
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 736, 1, 1)    0           concatenate_6[0][0]              
__________________________________________________________________________________________________
zero_padding2d_22 (ZeroPadding2 (None, 96, 5, 5)     0           activation_34[0][0]              
__________________________________________________________________________________________________
inception_5b_pool_conv (Conv2D) (None, 96, 1, 1)     70752       max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
inception_5b_3x3_conv2 (Conv2D) (None, 384, 3, 3)    332160      zero_padding2d_22[0][0]          
__________________________________________________________________________________________________
inception_5b_pool_bn (BatchNorm (None, 96, 1, 1)     384         inception_5b_pool_conv[0][0]     
__________________________________________________________________________________________________
inception_5b_1x1_conv (Conv2D)  (None, 256, 3, 3)    188672      concatenate_6[0][0]              
__________________________________________________________________________________________________
inception_5b_3x3_bn2 (BatchNorm (None, 384, 3, 3)    1536        inception_5b_3x3_conv2[0][0]     
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 96, 1, 1)     0           inception_5b_pool_bn[0][0]       
__________________________________________________________________________________________________
inception_5b_1x1_bn (BatchNorma (None, 256, 3, 3)    1024        inception_5b_1x1_conv[0][0]      
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 384, 3, 3)    0           inception_5b_3x3_bn2[0][0]       
__________________________________________________________________________________________________
zero_padding2d_23 (ZeroPadding2 (None, 96, 3, 3)     0           activation_36[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 256, 3, 3)    0           inception_5b_1x1_bn[0][0]        
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 736, 3, 3)    0           activation_35[0][0]              
                                                                 zero_padding2d_23[0][0]          
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
average_pooling2d_4 (AveragePoo (None, 736, 1, 1)    0           concatenate_7[0][0]              
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 736)          0           average_pooling2d_4[0][0]        
__________________________________________________________________________________________________
dense_layer (Dense)             (None, 128)          94336       flatten_1[0][0]                  
__________________________________________________________________________________________________
lambda_1 (Lambda)               (None, 128)          0           dense_layer[0][0]                
==================================================================================================
Total params: 3,743,280
Trainable params: 3,733,968
Non-trainable params: 9,312
__________________________________________________________________________________________________
